NOTICE
    Этот проект представляет собой веб-приложение для управления жизненным 
    циклом серверов и приложений (Server Lifecycle Management, SLM). Проект 
    разработан с использованием следующих технологий и компонентов:

Используемые технологии и библиотеки:
    Python: Основной язык для логики приложения.
    PHP: Основной язык для серверной логики веб интерфейса.
    PostgreSQL: База данных для хранения информации о пользователях, задачах, оборудовании и инцидентах.
    HTML/CSS/JavaScript: Используются для создания пользовательского интерфейса и интерактивных элементов.
    JSON: Для хранения конфигурационных данных (например, config.json).

Лицензии:
    Apache License 2.0: Основная лицензия проекта. Подробности можно найти в файле LICENSE.

Сторонние библиотеки и ресурсы:
    Python-библиотеки:
        Flask (flask) - микрофреймворк для создания веб-приложений.
        Flask-CORS (flask-cors) - обработка CORS (Cross-Origin Resource Sharing) для Flask.
        Psycopg2 (psycopg2-binary) - адаптер PostgreSQL для Python.
        PyJWT (pyjwt) - работа с JWT (JSON Web Tokens).
        Bcrypt (bcrypt) - хеширование паролей.
        Python-dotenv (python-dotenv) - загрузка переменных окружения из .env-файла.
        LDAP3 (ldap3) - работа с LDAP-серверами.
        Cryptography (cryptography) - криптографические функции.
        Gunicorn (gunicorn) - WSGI-сервер для развертывания приложения.

    Другие зависимости:
        PHP-FPM (php-fpm) - FastCGI-процессор для обработки PHP-скриптов (если требуется интеграция с PHP).


Авторские права:
    Проект разработан и поддерживается командой разработчиков.
    Все права на исходный код и материалы проекта принадлежат их авторам, если не указано иное.


Использование:
    Проект может быть использован для управления жизненным циклом серверов и 
    приложений в образовательных, коммерческих или некоммерческих целях.
    При использовании проекта в коммерческих целях необходимо соблюдать 
    условия лицензии Apache License 2.0.

Ограничения ответственности:
    Разработчики проекта не несут ответственности за любые убытки или 
    повреждения, вызванные использованием данного программного обеспечения.
    Проект предоставляется "как есть", без каких-либо гарантий.

Контакты:
    Для вопросов, связанных с проектом, обращайтесь по адресу: levmikhailovish@yandex.ru

Благодарности:
    Спасибо всем, кто участвовал в разработке и тестировании проекта.
    Особая благодарность сообществу разработчиков за вдохновение и поддержку.

Примечание:
    Этот файл NOTICE является обязательным в соответствии с требованиями лицензии Apache License 2.0. 
    Он предоставляет информацию о проекте, его авторах и используемых технологиях.

            © 2025 Петунин Лев Михайлович. Все права защищены.